SOAP/envelope.xml


<?xml version="1.0" encoding="utf-8"?>
    <soapenv:Envelope
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:api="http://127.0.0.1/Integrics/Enswitch/API"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
            <soapenv:Body>
                <api:some_api_call soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
                    <username xsi:type="xsd:string">sa</username>
                        <password xsi:type="xsd:string">usac</password>
                </api:some_api_call>
            </soapenv:Body>
    </soapenv:Envelope>